index=main (EventCode=4624 OR EventID=4624 OR EventCode=4625 OR EventID=4625)
| stats count(eval(EventCode=4625 OR EventID=4625)) AS failed_logons, count(eval(EventCode=4624 OR EventID=4624)) AS successful_logons by Account_Name
| where failed_logons >= 3 AND successful_logons >= 1
